# Chapter 7 - Data I/O
## Reading Non-Tabular Excel Files

In [1]:
import pandas as pd
import openpyxl
from pathlib import Path
input_file = Path.cwd()/'data'/'raw'/'excel_complicated_document.xlsx'
df = pd.read_excel(input_file,engine='openpyxl')
df.head()

Empty DataFrame
Columns: []
Index: []

What the ...? Empty import, that's because the data is in a different sheet, so we need to specify the sheet.

In [2]:
df = pd.read_excel(input_file,engine='openpyxl',sheet_name='sales data')

In [3]:
df.head()

,invoice,company,purchase_date,product,quantity,price,extended amount,Average Price,22.816
0,ZN-870-29,Realcube,2019-03-05,shirt,19,17,323,Standard Deviation,7.533269
1,JQ-501-63,Zooxo,2019-07-09,book,30,14,420,NaN,NaN
2,FI-165-58,Dabtype,2019-08-12,poster,7,23,161,Total Qty Sold,NaN
3,XP-005-55,Skipfire,2019-11-18,pen,7,29,203,shirt,6249.000000
4,NB-917-18,Bluezoom,2019-04-18,poster,36,19,684,book,5340.000000

Much better, but there's dud columns where it says 'Average Price' etc., so we need to specify the import columns.

In [4]:
df = pd.read_excel(input_file,engine='openpyxl',sheet_name='sales data',usecols='A:G')

In [5]:
df.head()

     invoice   company purchase_date product  quantity  price  extended amount
0  ZN-870-29  Realcube    2019-03-05   shirt        19     17              323
1  JQ-501-63     Zooxo    2019-07-09    book        30     14              420
2  FI-165-58   Dabtype    2019-08-12  poster         7     23              161
3  XP-005-55  Skipfire    2019-11-18     pen         7     29              203
4  NB-917-18  Bluezoom    2019-04-18  poster        36     19              684

Let's do another sheet.

In [6]:
df = pd.read_excel(input_file,engine='openpyxl',sheet_name='levels')

In [7]:
df.head()

,Compiled by hand,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,NaN,New Levels from the CMO,NaN,NaN,NaN,NaN,NaN
1,Company Name,Notes,level,ZipCode,update_month,update_day,update_year,pct_to_target
2,Abatz,Not Sure about this one,diamond,14150,3,1,2019,100%
3,Agivu,NaN,silver,61354,3,1,2019,90%
4,Aibox,NaN,platinum,04442,3,1,2019,105%

Whoa, what happened there? Headers are on row 3! (Which is index 2 counting from zero) So we specify where the headers is.

In [8]:
df = pd.read_excel(input_file,engine='openpyxl',sheet_name='levels',header=2)

In [9]:
df.head()

,Company Name,Notes,level,ZipCode,update_month,update_day,update_year,pct_to_target
0,Abatz,Not Sure about this one,diamond,14150,3,1,2019,100%
1,Agivu,NaN,silver,61354,3,1,2019,90%
2,Aibox,NaN,platinum,4442,3,1,2019,105%
3,Ailane,NaN,silver,78595,3,1,2019,60%
4,Aimbo,NaN,diamond,55447,3,1,2019,100%

Let's kill the 'Notes' column by not importing it in the first place.

In [10]:
df = pd.read_excel(input_file,engine='openpyxl',sheet_name='levels',header=2,usecols='A,C:H')

In [11]:
df.head()

,Company Name,level,ZipCode,update_month,update_day,update_year,pct_to_target
0,Abatz,diamond,14150,3,1,2019,100%
1,Agivu,silver,61354,3,1,2019,90%
2,Aibox,platinum,4442,3,1,2019,105%
3,Ailane,silver,78595,3,1,2019,60%
4,Aimbo,diamond,55447,3,1,2019,100%

## Converting Data Types

Use `parse_dates` to make a date out of columns 3,4 and 5

In [12]:
df = pd.read_excel(input_file,
                   engine='openpyxl',
                   sheet_name='levels',
                   header=2,
                   usecols='A,C:H',
                   parse_dates={'update_date':[3,4,5]})

In [13]:
df.head()

  update_date Company Name     level  ZipCode pct_to_target
0  2019-03-01        Abatz   diamond    14150          100%
1  2019-03-01        Agivu    silver    61354           90%
2  2019-03-01        Aibox  platinum     4442          105%
3  2019-03-01       Ailane    silver    78595           60%
4  2019-03-01        Aimbo   diamond    55447          100%

Use `dtype` to preserve trailing zeroes (like using backtick in Excel for 413649692)

In [14]:
df = pd.read_excel(input_file,
                   engine='openpyxl',
                   sheet_name='levels',
                   header=2,
                   usecols='A,C:H',
                   parse_dates={'update_date':[3,4,5]},
                   dtype={'ZipCode':'object'})

In [15]:
df.head()

  update_date Company Name     level ZipCode pct_to_target
0  2019-03-01        Abatz   diamond   14150          100%
1  2019-03-01        Agivu    silver   61354           90%
2  2019-03-01        Aibox  platinum   04442          105%
3  2019-03-01       Ailane    silver   78595           60%
4  2019-03-01        Aimbo   diamond   55447          100%

Percentages are still as string. To fix this, first write a function that converts percentage string (e.g. "90%") to the corresponding float (e.g. 0.9):

In [16]:
def percent(a):
    a = a.replace('%','')
    return float(a)/100

Then, apply this function 'percent' to the target column (the target column only!)

In [17]:
df['pct_to_target']=df['pct_to_target'].apply(percent)

In [18]:
df.head()

  update_date Company Name     level ZipCode  pct_to_target
0  2019-03-01        Abatz   diamond   14150           1.00
1  2019-03-01        Agivu    silver   61354           0.90
2  2019-03-01        Aibox  platinum   04442           1.05
3  2019-03-01       Ailane    silver   78595           0.60
4  2019-03-01        Aimbo   diamond   55447           1.00

*Alternatively*, add `converters={'pct_to_target':percent)` to the import arguments menu.

## Saving Dataframes to Excel

In [21]:
src_file = Path.cwd()/'data'/'raw'/'excel_complicated_document.xlsx'
report_file = Path.cwd()/'reports'/'TPS_report.xlsx'

In [22]:
df_sale = pd.read_excel(src_file, sheet_name = 'sales data',usecols=('A:G'))

In [23]:
df_sale.head()

     invoice   company purchase_date product  quantity  price  extended amount
0  ZN-870-29  Realcube    2019-03-05   shirt        19     17              323
1  JQ-501-63     Zooxo    2019-07-09    book        30     14              420
2  FI-165-58   Dabtype    2019-08-12  poster         7     23              161
3  XP-005-55  Skipfire    2019-11-18     pen         7     29              203
4  NB-917-18  Bluezoom    2019-04-18  poster        36     19              684

Do a simple summary (in one line, how cool is that!):

In [27]:
sales_summary = df_sale.groupby(['company','product']).agg({'extended amount':sum})

In [28]:
sales_summary.head()

                 extended amount
company product
Abatz   book                2063
        pen                  140
        poster              1248
Agivu   book                 385
        shirt                700

How about another summary, this time a global summary of amounts and prices:

In [30]:
sales_avg = df_sale.agg({'extended amount':['sum','mean'], 'price':['mean']})

In [31]:
sales_avg

      extended amount   price
sum         510270.00     NaN
mean           510.27  22.816

It doesn't make sense to add up all the prices, so fill that `Nan` with 'Not Applicable':

In [32]:
sales_avg = df_sale.agg({'extended amount':['sum','mean'], 'price':['mean']}).fillna('NOT APPLICABLE')

In [33]:
sales_avg

      extended amount           price
sum         510270.00  NOT APPLICABLE
mean           510.27          22.816

We can't get enough of data summaries, how about another one, this time a global summary of the products themselves:

In [34]:
product_summary = pd.pivot_table(data = df_sale,
                                 index = ['product'],
                                 values = ['extended amount'],
                                 aggfunc = ['sum','mean','count'])

In [35]:
product_summary

                    sum            mean           count
        extended amount extended amount extended amount
product
book             118356      505.794872             234
pen              115017      508.924779             226
poster           139008      516.758364             269
shirt            137889      508.815498             271

Now we're ready to export to Excel. Start with a simple write of the first summary that we did (sales summary):

In [36]:
sales_summary.to_excel(report_file)